Revit 2027 API
WaterLoopData.CondenserWaterLoopId Property
 The water loop element id for the water cooled chiller.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CondenserWaterLoopId { get; set; }
Public Property CondenserWaterLoopId As ElementId
	Get
	Set
public:
property ElementId^ CondenserWaterLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CondenserWaterLoopId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace